In [ ]:
Transformation and Loading

In [ ]:
This part of the code transforms the raw data, checks for any null or duplicates values and loads the transformed data into azure 
Synapses.

In [ ]:
The provided code performs the following tasks:

1. Folder and File Specification:
   - Specifies the folder path where the CSV files are located (`folder_path`).
   - Lists the names of CSV files to be read (`file_names`).

2. DataFrame Reading and Storage:
   - Uses a loop to iterate through each CSV file.
   - Constructs the full path for each file using `os.path.join`.
   - Reads each CSV file into a DataFrame using `pd.read_csv`.
   - Creates a dictionary (`data_frames`) to store DataFrames, where keys are derived from file names.

3. DataFrame Naming Convention:
   - Derives DataFrame names (`df_name`) from the file names by extracting the type (e.g., "markets") and appending "_df".
   - Creates a dictionary entry with the DataFrame name as the key and the corresponding DataFrame as the value.

4. Displaying the Head of Each DataFrame:
   - Uses a loop to iterate through the dictionary of DataFrames (`data_frames`).
   - Prints the head of each DataFrame using `display(df.head())`.

5. Error Handling:
   - Catches potential errors such as `FileNotFoundError`, `EmptyDataError`, and `ParserError` and prints an error message.

6. Example Usage:
   - Demonstrates how to access the individual DataFrames (`markets_df`, `transactions_df`, etc.) after reading and storing them.

Overall, the code automates the process of reading multiple CSV files from a specified folder, creating DataFrames, and storing them in a 
dictionary for easy access. It also provides error handling for potential issues during file reading.

In [1]:
import os
import pandas as pd
from IPython.display import display

# Specify the folder path
folder_path = r"C:\Users\cmald\Downloads"

# List of file names
file_names = ["markets_08032024.csv", "transactions_03082024.csv", "products_08032024.csv", "date_08032024.csv", "customer_08032024.csv"]

# Dictionary to store DataFrames
data_frames = {}

try:
    # Loop through each file name
    for file_name in file_names:
        # Construct the full path to each CSV file
        full_path = os.path.join(folder_path, file_name)

        # Read the CSV file into a DataFrame and store it in the dictionary
        df_name = file_name.split('_')[0].lower() + "_df"  # Extracting type (e.g., "customer") and creating DataFrame name
        data_frames[df_name] = pd.read_csv(full_path)

    # Display the head of each DataFrame
    for df_name, df in data_frames.items():
        print(f"\nHead of {df_name}:")
        display(df.head())

    # Example usage:
    # You can now access the DataFrames using their respective names
    markets_df = data_frames['markets_df']
    transactions_df = data_frames['transactions_df']
    products_df = data_frames['products_df']
    date_df = data_frames['date_df']
    customer_df = data_frames['customer_df']

except FileNotFoundError as e:
    print(f"Error: {e}")

except pd.errors.EmptyDataError as e:
    print(f"Error: {e}")

except pd.errors.ParserError as e:
    print(f"Error: {e}")

Head of markets_df:

  markets_code markets_name     zone
0      Mark001      Chennai    South
1      Mark002       Mumbai  Central
2      Mark003    Ahmedabad    North
3      Mark004    Delhi NCR    North
4      Mark005       Kanpur    North

Head of transactions_df:

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
0,Prod001,Cus001,Mark001,2017-10-10,100.0,41241.0,INR
1,Prod001,Cus002,Mark002,2018-05-08,3.0,-1.0,INR
2,Prod002,Cus003,Mark003,2018-04-06,1.0,875.0,INR
3,Prod002,Cus003,Mark003,2018-04-11,1.0,583.0,INR
4,Prod002,Cus004,Mark003,2018-06-18,6.0,7176.0,INR

Head of products_df:

  product_code product_type
0      Prod001  Own Brand\r
1      Prod002  Own Brand\r
2      Prod003  Own Brand\r
3      Prod004  Own Brand\r
4      Prod005  Own Brand\r

Head of date_df:

         date     cy_date  year month_name date_yy_mmm
0  2017-06-01  2017-06-01  2017       June    17-Jun\r
1  2017-06-02  2017-06-01  2017       June    17-Jun\r
2  2017-06-03  2017-06-01  2017       June    17-Jun\r
3  2017-06-04  2017-06-01  2017       June    17-Jun\r
4  2017-06-05  2017-06-01  2017       June    17-Jun\r

Head of customer_df:

  customer_code    custmer_name   customer_type
0        Cus001    Surge Stores  Brick & Mortar
1        Cus002    Nomad Stores  Brick & Mortar
2        Cus003    Excel Stores  Brick & Mortar
3        Cus004  Surface Stores  Brick & Mortar
4        Cus005  Premium Stores  Brick & Mortar

In [ ]:
The five dataframes are:
1) markets_df
2) transactions_df
3) products_df
4) date_df
5) customer_df

In [ ]:
Perform EDA on each of the five files

In [ ]:
######################################### Markets ###############################################

In [3]:
display(markets_df.head())

  markets_code markets_name     zone
0      Mark001      Chennai    South
1      Mark002       Mumbai  Central
2      Mark003    Ahmedabad    North
3      Mark004    Delhi NCR    North
4      Mark005       Kanpur    North

In [11]:
from IPython.display import display

# Display basic information about the DataFrame
print("Summary of markets_df:")
display(markets_df.info())

# Display descriptive statistics of numerical columns
print("\nDescriptive Statistics:")
display(markets_df.describe())

# Display the first few rows of the DataFrame
print("\nFirst few rows of markets_df:")
display(markets_df.head())

# Check for missing values
print("\nMissing Values:")
display(markets_df.isnull().sum())

# Unique values in 'zone' column
print("\nUnique values in 'zone' column:")
display(markets_df['zone'].unique())

# Value counts for 'zone' column
print("\nValue counts for 'zone' column:")
display(markets_df['zone'].value_counts())

Summary of markets_df:
<class 'pandas.core.frame.DataFrame'>
Index: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   markets_code  15 non-null     object
 1   markets_name  15 non-null     object
 2   zone          15 non-null     object
dtypes: object(3)
memory usage: 480.0+ bytes

None

Descriptive Statistics:

       markets_code markets_name   zone
count            15           15     15
unique           15           14      3
top         Mark001       Bhopal  North
freq              1            2      6

First few rows of markets_df:

  markets_code markets_name     zone
0      Mark001      Chennai    South
1      Mark002       Mumbai  Central
2      Mark003    Ahmedabad    North
3      Mark004    Delhi NCR    North
4      Mark005       Kanpur    North

Missing Values:

markets_code    0
markets_name    0
zone            0
dtype: int64

Unique values in 'zone' column:

array(['South', 'Central', 'North'], dtype=object)

Value counts for 'zone' column:

zone
North      6
South      5
Central    4
Name: count, dtype: int64

In [ ]:
In the ZONE column there are null values, hence removing the rows which have null values

In [5]:
# Drop rows with NaN values in the 'zone' column
markets_df = markets_df.dropna(subset=['zone'])

# Display the first few rows of the DataFrame after removing NaN values
print("\nFirst few rows of markets_df after removing NaN values:")
print(markets_df.head())

First few rows of markets_df after removing NaN values:
  markets_code markets_name     zone
0      Mark001      Chennai    South
1      Mark002       Mumbai  Central
2      Mark003    Ahmedabad    North
3      Mark004    Delhi NCR    North
4      Mark005       Kanpur    North

In [20]:
import pandas as pd

# Specify the path where you want to save the CSV file
csv_path = r'C:\Users\cmald\Desktop\ETL-Project\transformed_op\markets_transformed.csv'

# Use the to_csv method to save the dataframe to a CSV file
markets_df.to_csv(csv_path, index=False)

# Print a message to confirm the operation
print(f'Dataframe has been saved to {csv_path}')

Dataframe has been saved to C:\Users\cmald\Desktop\ETL-Project\transformed_op\markets_transformed.csv

In [ ]:
########################################## Transactions ############################################

In [7]:
display(transactions_df.head())

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
0,Prod001,Cus001,Mark001,2017-10-10,100.0,41241.0,INR
1,Prod001,Cus002,Mark002,2018-05-08,3.0,-1.0,INR
2,Prod002,Cus003,Mark003,2018-04-06,1.0,875.0,INR
3,Prod002,Cus003,Mark003,2018-04-11,1.0,583.0,INR
4,Prod002,Cus004,Mark003,2018-06-18,6.0,7176.0,INR

In [10]:
import pandas as pd

# Remove rows with missing values
transactions_df = transactions_df.dropna()

# Remove trailing '\r' from the 'currency' column
transactions_df['currency'] = transactions_df['currency'].str.strip()

# Convert 'order_date' to datetime format
transactions_df['order_date'] = pd.to_datetime(transactions_df['order_date'], errors='coerce')

# Remove rows with NaN values in 'order_date'
transactions_df = transactions_df.dropna(subset=['order_date'])

# Display the cleaned DataFrame
print("Cleaned transactions_df:")
display(transactions_df.head())

Cleaned transactions_df:

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
0,Prod001,Cus001,Mark001,2017-10-10,100.0,41241.0,INR
1,Prod001,Cus002,Mark002,2018-05-08,3.0,-1.0,INR
2,Prod002,Cus003,Mark003,2018-04-06,1.0,875.0,INR
3,Prod002,Cus003,Mark003,2018-04-11,1.0,583.0,INR
4,Prod002,Cus004,Mark003,2018-06-18,6.0,7176.0,INR

In [21]:
import pandas as pd

# Specify the path where you want to save the CSV file
csv_path = r'C:\Users\cmald\Desktop\ETL-Project\transformed_op\transactions_transformed.csv'

# Use the to_csv method to save the dataframe to a CSV file
transactions_df.to_csv(csv_path, index=False)

# Print a message to confirm the operation
print(f'Dataframe has been saved to {csv_path}')

Dataframe has been saved to C:\Users\cmald\Desktop\ETL-Project\transformed_op\transactions_transformed.csv

In [ ]:
########################################## Products ############################################

In [14]:
display(products_df.head())

  product_code product_type
0      Prod001    Own Brand
1      Prod002    Own Brand
2      Prod003    Own Brand
3      Prod004    Own Brand
4      Prod005    Own Brand

In [13]:
# Remove trailing '\r' from the 'product_type' column
products_df['product_type'] = products_df['product_type'].str.strip()

# Display the first few rows of the DataFrame after cleaning
print("\nFirst few rows of products_df after cleaning:")
display(products_df.head())

First few rows of products_df after cleaning:

  product_code product_type
0      Prod001    Own Brand
1      Prod002    Own Brand
2      Prod003    Own Brand
3      Prod004    Own Brand
4      Prod005    Own Brand

In [22]:
import pandas as pd

# Specify the path where you want to save the CSV file
csv_path = r'C:\Users\cmald\Desktop\ETL-Project\transformed_op\products_transformed.csv'

# Use the to_csv method to save the dataframe to a CSV file
transactions_df.to_csv(csv_path, index=False)

# Print a message to confirm the operation
print(f'Dataframe has been saved to {csv_path}')

Dataframe has been saved to C:\Users\cmald\Desktop\ETL-Project\transformed_op\products_transformed.csv

In [ ]:
########################################## date_df ############################################

In [15]:
display(date_df.head())

         date     cy_date  year month_name date_yy_mmm
0  2017-06-01  2017-06-01  2017       June    17-Jun\r
1  2017-06-02  2017-06-01  2017       June    17-Jun\r
2  2017-06-03  2017-06-01  2017       June    17-Jun\r
3  2017-06-04  2017-06-01  2017       June    17-Jun\r
4  2017-06-05  2017-06-01  2017       June    17-Jun\r

In [17]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from IPython.display import display

# Rename columns in proper order
date_df = date_df.rename(columns={'date': 'full_date', 'cy_date': 'cy_date', 'year': 'year', 'month_name': 'month_name', 'date_yy_mmm': 'date_yy_mmm'})

# Display basic information about the DataFrame
print("Summary of date_df:")
display(date_df.info())

# Check for unique values and value counts in 'year' and 'month_name' columns
print("\nUnique values in 'year' column:")
display(date_df['year'].unique())

print("\nValue counts for 'year' column:")
display(date_df['year'].value_counts())

print("\nUnique values in 'month_name' column:")
display(date_df['month_name'].unique())

print("\nValue counts for 'month_name' column:")
display(date_df['month_name'].value_counts())

# Check for missing values
print("\nMissing Values:")
display(date_df.isnull().sum())

Summary of date_df:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1126 entries, 0 to 1125
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   full_date    1126 non-null   object
 1   cy_date      1126 non-null   object
 2   year         1126 non-null   int64
 3   month_name   1126 non-null   object
 4   date_yy_mmm  1126 non-null   object
dtypes: int64(1), object(4)
memory usage: 44.1+ KB

None

Unique values in 'year' column:

array([2017, 2018, 2019, 2020], dtype=int64)

Value counts for 'year' column:

year
2018    365
2019    365
2017    214
2020    182
Name: count, dtype: int64

Unique values in 'month_name' column:

array(['June', 'July', 'August', 'September', 'October', 'November',
       'December', 'January', 'February', 'March', 'April', 'May'],
      dtype=object)

Value counts for 'month_name' column:

month_name
June         120
July          93
August        93
October       93
December      93
January       93
March         93
May           93
September     90
November      90
April         90
February      85
Name: count, dtype: int64

Missing Values:

full_date      0
cy_date        0
year           0
month_name     0
date_yy_mmm    0
dtype: int64

In [23]:
import pandas as pd

# Specify the path where you want to save the CSV file
csv_path = r'C:\Users\cmald\Desktop\ETL-Project\transformed_op\date_transformed.csv'

# Use the to_csv method to save the dataframe to a CSV file
date_df.to_csv(csv_path, index=False)

# Print a message to confirm the operation
print(f'Dataframe has been saved to {csv_path}')

Dataframe has been saved to C:\Users\cmald\Desktop\ETL-Project\transformed_op\date_transformed.csv

In [ ]:
########################################## customer_df ############################################

In [18]:
display(customer_df.head())

  customer_code    custmer_name   customer_type
0        Cus001    Surge Stores  Brick & Mortar
1        Cus002    Nomad Stores  Brick & Mortar
2        Cus003    Excel Stores  Brick & Mortar
3        Cus004  Surface Stores  Brick & Mortar
4        Cus005  Premium Stores  Brick & Mortar

In [19]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from IPython.display import display

# Assuming you have already loaded the 'customer_df' DataFrame

# Rename columns in proper order
customer_df = customer_df.rename(columns={'customer_code': 'customer_code', 'custmer_name': 'customer_name', 'customer_type': 'customer_type'})

# Display basic information about the DataFrame
print("Summary of customer_df:")
display(customer_df.info())

# Check for unique values and value counts in 'customer_type' column
print("\nUnique values in 'customer_type' column:")
display(customer_df['customer_type'].unique())

print("\nValue counts for 'customer_type' column:")
display(customer_df['customer_type'].value_counts())

# Check for missing values
print("\nMissing Values:")
display(customer_df.isnull().sum())

Summary of customer_df:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_code  38 non-null     object
 1   customer_name  38 non-null     object
 2   customer_type  38 non-null     object
dtypes: object(3)
memory usage: 1.0+ KB

None

Unique values in 'customer_type' column:

array(['Brick & Mortar', 'E-Commerce'], dtype=object)

Value counts for 'customer_type' column:

customer_type
Brick & Mortar    19
E-Commerce        19
Name: count, dtype: int64

Missing Values:

customer_code    0
customer_name    0
customer_type    0
dtype: int64

In [24]:
import pandas as pd

# Specify the path where you want to save the CSV file
csv_path = r'C:\Users\cmald\Desktop\ETL-Project\transformed_op\customer_transformed.csv'

# Use the to_csv method to save the dataframe to a CSV file
customer_df.to_csv(csv_path, index=False)

# Print a message to confirm the operation
print(f'Dataframe has been saved to {csv_path}')

Dataframe has been saved to C:\Users\cmald\Desktop\ETL-Project\transformed_op\customer_transformed.csv